Tekla.Structures.Drawing.Units
The available unit types.

Tekla.Structures.Drawing.Units.Automatic
Automatic, chooses the most appropriate unit for the current environment.

Tekla.Structures.Drawing.Units.Millimeters
Show the value in millimeters.

Tekla.Structures.Drawing.Units.Centimeters
Show the value in centimeters.

Tekla.Structures.Drawing.Units.Meters
Show the value in meters.

Tekla.Structures.Drawing.Units.FeetAndInches
Show the value in feet and inches.

Tekla.Structures.Drawing.Units.CentimetersOrMeters
Show the value in centimeters or meters whichever is more appropriate.

Tekla.Structures.Drawing.Units.Inches
Show the value in inches.

Tekla.Structures.Drawing.Units.Feet
Show the value in feet.